#include <iostream>

int main() {
    // Напишете програма, която приема от входа две двойки реални числа, отговарящи на две точки в равнината.
    // Да се отпечата растоянието между точките закръглено до 2 - рия знак след десетичната запетая.
    // Потърсете математическата формула в интернет ако не я знаете!

    double x1, y1, x2, y2;
    std::cout << "Enter two numbers: ";
    std::cin >> x1 >> y1 >> x2 >> y2;

    std::cout << std::fixed << std::setprecision(2) << ((x2 - x1) * (x2 - x1)) + ((y2 - y1) * (y2 - y1));


	return 0;
}